# ЗАДАНИЕ 1: Работа с множествами

# Дано множество фруктов:
fruits = {"яблоко", "банан"}

# 1. Добавьте "апельсин" в множество
# 2. Добавьте несколько элементов ["груша", "виноград"] используя update()
# 3. Удалите "банан" используя discard()
# 4. Попробуйте удалить "киви" используя discard() (элемента нет в множестве)
# 5. Попробуйте удалить "киви" используя remove() (элемента нет в множестве) - закомментируйте эту строку
# 6. Удалите и сохраните произвольный элемент используя pop()
# 7. Выведите результат


# ЗАДАНИЕ 2: Работа с кортежами

# Дано:
coordinates = (10, 20, 30, 20, 10, 20, 40)

# 1. Выведите первый элемент кортежа
# 2. Выведите последний элемент кортежа
# 3. Выведите срез с 2-го по 4-й элемент (включительно)
# 4. Проверьте, есть ли число 30 в кортеже (используйте оператор in)
# 5. Найдите индекс первого вхождения числа 20
# 6. Подсчитайте, сколько раз встречается число 20
# 7. Подсчитайте, сколько раз встречается число 50 (его нет в кортеже)
# 8. Выведите длину кортежа